
Функция Сканер() Экспорт
	
	// Переписать без списка адресов
	СписокАдресов = Новый СписокЗначений();
	Выборка = Справочники.Тест_Адреса.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		СписокАдресов.Добавить(Выборка.Наименование);	
	
	КонецЦикла;
	
	Для каждого Элемент Из СписокАдресов Цикл
		
		МенеджерЗаписи = РегистрыСведений.БуферАдресов.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Адрес = Элемент;
		МенеджерЗаписи.Дата = ТекущаяДата();
		МенеджерЗаписи.Записать();		
		
	КонецЦикла;
	
КонецФункции


